# == Fonts ==
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "sf-symbols"

# == Applications ==
cask "claude"
cask "claude-code"
cask "dbeaver-community"
cask "docker-desktop"
cask "flux-app"
cask "gcloud-cli"
cask "ghostty"
cask "karabiner-elements"
cask "logi-options+"
cask "maccy"
cask "nordpass"
cask "nordvpn"
cask "obsidian"
cask "rectangle"
cask "spotify"
cask "tailscale-app"
cask "telegram"
cask "vesktop"
cask "zed"
cask "zen"

# == Programming languages ==
brew "elixir"
brew "erlang"
brew "gcc"
brew "gleam"
brew "lua"
brew "rust"

# == Package managers ==
brew "poetry"
brew "rustup"
brew "uv"

# == Databases ==
brew "duckdb"

# == Command-line tools ==
brew "bat"
brew "bottom"
brew "curl"
brew "dotdrop"
brew "exercism"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "git-filter-repo"
brew "gnupg"
brew "graphviz"
brew "hcloud"
brew "helix"
brew "hyperfine"
brew "jq"
brew "just"
brew "k9s"
brew "lazydocker"
brew "lazygit"
brew "mas"
brew "maturin"
brew "minikube"
brew "mole"
brew "opentofu"
brew "prettier"
brew "pnpm"
brew "pinentry-mac"
brew "pivoshenko/tap/kasetto"
brew "pyenv"
brew "ripgrep"
brew "spicetify-cli"
brew "starship"
brew "vercel-cli"
brew "vhs"
brew "wget"
brew "whalebrew"
brew "zellij"
brew "zoxide"

# == Language server protocols ==
brew "elixir-ls"
brew "marksman"
brew "taplo"
brew "vscode-langservers-extracted"
brew "yaml-language-server"

# == Python packages ==
brew "pyupgrade"
brew "ruff"
brew "sqlfluff"
brew "ty"
